html/erlang/tutorial/fault-tolerance/error-handle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>错误处理</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="timeout.html"> UP </a>
 |
 <a accesskey="H" href="fault-tolerance.html"> HOME </a>
</div><div id="content">
<h1 class="title">错误处理</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2d6ea4c">进程终止</a></li>
<li><a href="#orgcb97923">进程连接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2d6ea4c" class="outline-2">
<h2 id="org2d6ea4c">进程终止</h2>
<div class="outline-text-2" id="text-org2d6ea4c">
<pre class="example">
在讨论监督与错误处理细节之前，先一起来看一下 Erlang 进程的终止过程，或者说 Erlang 的术语 exit
</pre>

<ul class="org-ul">
<li>进程 <b>执行 0exit(normal)</b> 结束或者 <b>运行完所有的代码</b> 而结束都被认为是进程的 <span class="underline">正常终止</span></li>
<li>进程因为 <b>触发运行时错误</b> （例如，除零、错误匹配、调用不存在了函数等）而终止被称之为 <span class="underline">异常终止</span> 
<ul class="org-ul">
<li>进程 <b>执行 exit(Reason)</b> （此处的 Reason 是除 normal 以外的值）终止也被称之为异常终止</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcb97923" class="outline-2">
<h2 id="orgcb97923">进程连接</h2>
<div class="outline-text-2" id="text-orgcb97923">
<p>
一个 Erlang 进程可以与其它 Erlang 进程建立连接。如果一个进程调用 <span class="underline">link(Other_Pid)</span> ，那么它就在其自己与 Othre_Pid 进程之间创建了一个 <b>双向连接</b> ：
</p>
<ul class="org-ul">
<li>当一个进程结束时，它会 <b>发送信号</b> 至 <span class="underline">所有与之有连接的进程</span> ，这个信号携带着：
<ul class="org-ul">
<li>进程的进程标识符</li>
<li>进程结束的原因信息</li>
</ul></li>
<li>进程收到 <span class="underline">正常退出的信号</span> 时 <span class="underline">默认</span> 情况下是 <b>直接忽略它</b></li>
<li>如果进程收到的是 <span class="underline">异常终止</span> 的信号，则 <span class="underline">默认</span> 动作为：
<ol class="org-ol">
<li><b>忽略</b> <span class="underline">消息队列中的所有消息</span></li>
<li><b>杀死</b> <span class="underline">自己</span></li>
<li>将 <span class="underline">相同的错误消息</span> <b>传递</b> 给 <span class="underline">连接到它的所有进程</span></li>
</ol></li>
</ul>

<pre class="example">
所以可以使用连接的方式把同一事务的所有进程连接起来

如果其中一个进程异常终止，事务中所有进程都会被杀死
</pre>
<p>
因为在实际生产过程中，常常有创建进程同时与之建立连接的需求，所以存在这样一个内置函数 <span class="underline">spawn_link</span> ，与 spawn 不同之处在于，它 <span class="underline">创建</span> 一个新进程同时在 <span class="underline">新进程</span> 与 <span class="underline">创建者</span> 之间建立连接。下面给出了 ping pong 示例子另外一种实现方法，它通过连接终止 "pong" 进程：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(link).

<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">start/1</span>,  <span style="color: #98f5ff;">ping/2</span>, <span style="color: #98f5ff;">pong/0</span>]).

<span style="color: #daa520; font-weight: bold;">ping</span>(<span style="color: #4eee94;">N</span>, <span style="color: #4eee94;">Pong_Pid</span>) -&gt;
    <span style="color: #f08080;">link</span>(<span style="color: #4eee94;">Pong_Pid</span>),
    <span style="color: #98f5ff;">ping1</span>(<span style="color: #4eee94;">N</span>, <span style="color: #4eee94;">Pong_Pid</span>).

<span style="color: #daa520; font-weight: bold;">ping1</span>(0, <span style="color: #4eee94;">_</span>) -&gt;
    <span style="color: #f08080;">exit</span>(ping);

<span style="color: #daa520; font-weight: bold;">ping1</span>(<span style="color: #4eee94;">N</span>, <span style="color: #4eee94;">Pong_Pid</span>) -&gt;
    <span style="color: #4eee94;">Pong_Pid</span> ! {ping, <span style="color: #f08080;">self</span>()},
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        pong -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Ping received pong~n"</span>, [])
    <span style="color: #00bfff; font-weight: bold;">end</span>,
    <span style="color: #98f5ff;">ping1</span>(<span style="color: #4eee94;">N</span> - 1, <span style="color: #4eee94;">Pong_Pid</span>).

<span style="color: #daa520; font-weight: bold;">pong</span>() -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        {ping, <span style="color: #4eee94;">Ping_PID</span>} -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Pong received ping~n"</span>, []),
            <span style="color: #4eee94;">Ping_PID</span> ! pong,
            <span style="color: #98f5ff;">pong</span>()
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #daa520; font-weight: bold;">start</span>(<span style="color: #4eee94;">Ping_Node</span>) -&gt;
    <span style="color: #4eee94;">PongPID</span> = <span style="color: #f08080;">spawn</span>(link, pong, []),
    <span style="color: #f08080;">spawn</span>(<span style="color: #4eee94;">Ping_Node</span>, link, ping, [3, <span style="color: #4eee94;">PongPID</span>]).
</pre>
</div>


<p>
与前面的代码一样，ping pong 程序的两个进程仍然都是在 start/1 函数中创建的，“ping”进程在单独的结点上建立的。但是这里做了一些小的改动，用到了内置函数 link
</p>
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">ping</span>(<span style="color: #4eee94;">N</span>, <span style="color: #4eee94;">Pong_Pid</span>) -&gt;
    <span style="color: #f08080;">link</span>(<span style="color: #4eee94;">Pong_Pid</span>),
</pre>
</div>
<p>
“Ping” 结束时调用 exit(ping) ，使得一个终止信号传递给 “pong” 进程，从而导致 “pong” 进程终止：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">ping1</span>(0, <span style="color: #4eee94;">_</span>) -&gt;
    <span style="color: #f08080;">exit</span>(ping);
</pre>
</div>

<p>
测试如下：
</p>

<div class="org-src-container">
<pre class="src src-sh">(c1@gentoo)1&gt; link:start(c2@raspberrypi) <span style="color: #f08080;">.</span>  
&lt;8806.88.0&gt;
(c1@gentoo)2&gt; 
Pong received ping
Ping received pong
Pong received ping
Ping received pong
Pong received ping
Ping received pong
(c1@gentoo)2&gt; 
</pre>
</div>

<p>
也可以修改进程收到异常终止信号时的默认行为，避免进程被杀死
</p>

<pre class="example">
把所有的信号都转变为一般的消息添加到信号接收进程的消息队列中，消息的格式为 {'EXIT',FromPID, Reason}
</pre>

<p>
通过如下的代码来设置：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">process_flag</span>(trap_exit, true)
</pre>
</div>

<p>
下面修改了 ping pong 程序来打印输出进程退出时的信息：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(link).

<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">start/1</span>,  <span style="color: #98f5ff;">ping/2</span>, <span style="color: #98f5ff;">pong/0</span>]).

<span style="color: #daa520; font-weight: bold;">ping</span>(<span style="color: #4eee94;">N</span>, <span style="color: #4eee94;">Pong_Pid</span>) -&gt;
    <span style="color: #f08080;">link</span>(<span style="color: #4eee94;">Pong_Pid</span>),
    <span style="color: #98f5ff;">ping1</span>(<span style="color: #4eee94;">N</span>, <span style="color: #4eee94;">Pong_Pid</span>).

<span style="color: #daa520; font-weight: bold;">ping1</span>(0, <span style="color: #4eee94;">_</span>) -&gt;
    <span style="color: #f08080;">exit</span>(ping);

<span style="color: #daa520; font-weight: bold;">ping1</span>(<span style="color: #4eee94;">N</span>, <span style="color: #4eee94;">Pong_Pid</span>) -&gt;
    <span style="color: #4eee94;">Pong_Pid</span> ! {ping, <span style="color: #f08080;">self</span>()},
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        pong -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Ping received pong~n"</span>, [])
    <span style="color: #00bfff; font-weight: bold;">end</span>,
    <span style="color: #98f5ff;">ping1</span>(<span style="color: #4eee94;">N</span> - 1, <span style="color: #4eee94;">Pong_Pid</span>).

<span style="color: #daa520; font-weight: bold;">pong</span>() -&gt;
    <span style="color: #f08080;">process_flag</span>(trap_exit, true), 
    <span style="color: #98f5ff;">pong1</span>().

<span style="color: #daa520; font-weight: bold;">pong1</span>() -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        {ping, <span style="color: #4eee94;">Ping_PID</span>} -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Pong received ping~n"</span>, []),
            <span style="color: #4eee94;">Ping_PID</span> ! pong,
            <span style="color: #98f5ff;">pong1</span>();
        {<span style="color: #deb887;">'EXIT'</span>, <span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Reason</span>} -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"pong exiting, got ~p~n"</span>, [{<span style="color: #deb887;">'EXIT'</span>, <span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Reason</span>}])
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #daa520; font-weight: bold;">start</span>(<span style="color: #4eee94;">Ping_Node</span>) -&gt;
    <span style="color: #4eee94;">PongPID</span> = <span style="color: #f08080;">spawn</span>(link, pong, []),
    <span style="color: #f08080;">spawn</span>(<span style="color: #4eee94;">Ping_Node</span>, link, ping, [3, <span style="color: #4eee94;">PongPID</span>]).
</pre>
</div>

<p>
测试可以看到 pong 进程并没有被异常信号而异常终止，而是再打出了 ping 进程终止的原因后正常终止
</p>
<div class="org-src-container">
<pre class="src src-sh">(c1@gentoo)4&gt; link:start(c2@raspberrypi) <span style="color: #f08080;">.</span>  
&lt;8806.89.0&gt;
(c1@gentoo)5&gt; 
Pong received ping
Ping received pong
Pong received ping
Ping received pong
Pong received ping
Ping received pong
pong exiting, got {<span style="color: #deb887;">'EXIT'</span>,&lt;8806.89.0&gt;,ping}
</pre>
</div>

<pre class="example">
还有其它可以用的进程标志，可参阅相关文档。

标准用户程序一般不需要改变进程对于信号的默认处理行为，但是对于 OTP 中的管理程序这个接口还是很有必要的
</pre>

<p>
<a href="example.html">Next：完整实例</a>
</p>

<p>
<a href="timeout.html">Previous：超时处理</a>
</p>

<p>
<a href="fault-tolerance.html">Home：容错编程</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
